{
  "1.0.0": {
    "en": "Added support for the devices Zappi, Eddi and Harvi"
  },
  "1.0.1": {
    "en": "Minor improvements and added Norwegian readme."
  },
  "1.1.4": {
    "en": "Added Dutch translation (Thanks to Spijkmans). Included accumulated power consumption for all Zappi CTs with type Internal Load. Also included a setting for displaying negative values or not."
  },
  "1.2.0": {
    "en": "Added frequency and settings for customizing charging power calculation for Zappi."
  },
  "1.3.0": {
    "en": "Added total energy consumption (power meter) to Zappi"
  },
  "1.4.0": {
    "en": "Added more human readable variables and tags (#13). Added THEN cards to support charge mode and boost mode (#17). Added slider to manually set min. green level. Reordered the sensor page and some bug fixes."
  },
  "1.4.1": {
    "en": "Improved pairing logic for Zappi"
  },
  "1.4.2": {
    "en": "Improved pairing logic for Harvi and Eddi devices"
  },
  "1.5.0": {
    "en": "Added remaining boost kWh to sensor page."
  },
  "1.5.1": {
    "en": "Improved text on flow card titles."
  },
  "1.5.2": {
    "en": "Added a setting for adjusting total energy consumption offset for Zappi"
  },
  "1.5.3": {
    "en": "Added improvements to settings page. Introduced API base url field in settings. Improved API authentication and redirection."
  },
  "1.5.4": {
    "en": "Improved authentication logic on app settings page."
  },
  "1.5.5": {
    "en": "Minor code cleanup"
  },
  "1.6.0": {
    "en": "Added new EV connected capability and included it in flows"
  },
  "1.6.1": {
    "en": "Fixed a bug that prevented control of multiple Zappi units from a flow."
  },
  "1.7.0": {
    "en": "Added total power and energy to Harvi device, together with a few extra capabilities."
  },
  "1.7.1": {
    "en": "Fixed a bug that prevented new Harvi devices from being added."
  },
  "1.7.2": {
    "en": "Bugfix for failing charge mode settings via flows"
  },
  "1.7.3": {
    "en": "Added cumulative energy flag to Harvi to be able to exclude it from total power calculation."
  },
  "1.7.4": {
    "en": "Updated dependencies (myenergi-api)"
  },
  "1.7.5": {
    "en": "Fixed a bug that crashed the app when setting total energy offset on Zappi and Harvi"
  },
  "1.7.6": {
    "en": "Fixed a bug that crashed the app when setting total energy offset on Zappi and Harvi"
  }
}
